Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: མཁའ་འགྲོ་མས་བྱས་པ་ལ་ཡང་བྲམ་ཟེའི་ལྡུམ་རའམ། ཁང་པ་སྟོང་པའམ། གནས་དབེན་པར་གཞོལ་བའི་ས་ཕྱོགས་སུ་བྱའོ། །
en: For the diseases caused by ḍākinīs, it should be drawn in a brahmin’s garden, an empty house, a lonely spot, or a depression in the terrain. {3.7}

source: དེ་བཞིན་དུ་ལས་ཐམས་ཅད་ལ་ནམ་ཕྱེད་དམ་དུས་ཐམས་ཅད་དུ་མངོན་པར་བྲི་བར་བྱའོ། །
en: “In all rituals such as these, the maṇḍala should be drawn at midnight, or midday, or otherwise at any time.

source: ཡི་གེ་གཅིག་པ་དེ་ཉིད་ཀྱི་སྔགས་ཀྱིས་མེ་ཏོག་གི་མཆོད་ཡོན་ཕུལ་ཏེ་གཤེགས་སུ་གསོལ་ལོ། །
en: Employing this very one-syllable mantra, one should present a welcome offering of flowers to the deity and then dismiss him.

source: དཀྱིལ་འཁོར་ལ་ཆུས་གཏོར་བ་བྱས་ན་ནད་ཐམས་ཅད་བསྲུང་བ་ཆེན་པོ་བྱས་པར་འགྱུར་ཏེ་ནད་ཐམས་ཅད་ལས་གྲོལ་བར་ཡང་འགྱུར་རོ། །
en: Having done so, one should inundate the maṇḍala with water. This will provide strong protection to all those who are weary. {3.8}

source: བུ་མེད་པས་ནི་བུ་རྙེད་ཅིང་། །སྐལ་མེད་རྣམས་ཀྱང་སྐལ་ལྡན་འགྱུར། །དབུལ་པོ་རྣམས་ཀྱིས་ནོར་འཐོབ་པ། །དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་གྱིས་སོ། །
en: “They will be freed from all illnesses And will attain their desired goals. One without a son will obtain a son, And the unfortunate will meet with good fortune. {3.9}

source: སྐྱེས་པའམ་ཡང་ན་བུད་མེད་ཀྱང་། །ཐོས་ནས་ཐེ་ཚོམ་མེད་བྱས་ན། །ཅི་འདོད་རྣམ་པ་སྣ་ཚོགས་ནི། །ཐོབ་འགྱུར་རྟག་ཏུ་ཕུན་སུམ་ཚོགས། །
en: “The destitute will obtain wealth Through merely seeing the maṇḍala. Anyone with faith in the ritual, Whether it is a woman or a man, Will meet, every time, With whatever kind of good fortune they wish for.” {3.10}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོ་ག་རབ་འབྱམ་ལས། །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྩ་བ་ལས་ཀྱི་དཀྱིལ་འཁོར་གསུམ་པའི་ལེའུ་སྟེ་གསུམ་པ་རྫོགས་སོ།། །།
en: This concludes the chapter on the maṇḍala procedure, the third in “The Root Manual of the Divine Youth Mañjuśrī,” an extensive bodhisattva textbook.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཐམས་ཅད་དང་ལྡན་པའི་གནས་གཙང་མ་ལ་གཟིགས་ནས། གཞན་ཡང་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་འདུས་པ་ལ་ཡང་གཟིགས་ཏེ།
en: Mañjuśrī then looked at the entire realm of the Pure Abode and again directed his gaze at the great assembly gathered there.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཞབས་གཉིས་ལ་བཏུད་ནས་ཞལ་འཛུམ་པ་དང་ལྡན་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Prostrating at the feet of Śākyamuni, he smiled and said this to the Blessed One: {4.1}

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་ཕྱིར་སྔགས་ཀྱི་སྤྱོད་པའི་ཆོ་གའི་སྒྲུབ་པའི་རྒྱུ་མཐུན་པ། ཆོས་ཀྱི་ཆར་ཅི་ལྟར་འདོད་པའི་འབྲས་བུ་སྒྲུབ་པའི་ཆོ་ག་རབ་འབྱམ་ལས་རས་ཀྱི་རི་མོའི་ཆོ་ག་བསོད་ནམས་བླ་ན་མེད་པ་སྐྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ས་བོན་མངོན་པར་སྒྲུབ་པར་བྱེད་པ།
en: “It is good fortune, O Blessed One, that there is a painting procedure, intended for the benefit of all beings, from the extensive chapters that produce a rain of desired results falling down from the Cloud of Dharma that arises from the accomplishment of sādhana methods of mantra practice. This procedure generates a vast amount of merit and creates the seed of perfect awakening; it also brings complete omniscience. {4.2}

source: མདོར་ན་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་སྔགས་ཐམས་ཅད་ཀྱི་འབྲས་བུ་ལ་རབ་ཏུ་སྦྱོར་ཞིང་འབྲས་བུ་དང་བཅས་པར་བྱེད་པ།
en: “In short, it completely fulfills all wishes; it grants the complete acquisition of the fruits of all mantras;

source: དོན་མེད་པ་མ་ཡིན་པ་གྲུབ་ཅིང་སྒྲུབ་པར་བྱེད་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: it brings about accomplishments that are fruitful and effective, as well as the complete fulfillment of bodhisattva conduct;

source: བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་གོ་ཆ་བགོས་པ།
en: it equips one with the armor of a great bodhisattva;

source: བདུད་ཐམས་ཅད་ཀྱི་སྟོབས་ཟིལ་གྱིས་མནན་ཅིང་རྒྱབ་ཀྱིས་ཕྱོགས་པར་བྱེད་པ་བདག་དང་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་དེ་ལེགས་པར་བཤད་དུ་གསོལ།
en: and it overpowers and puts to flight the entire army of Māra. Please take pity on us, O Blessed One, and on all beings, and teach us this procedure.” {4.3}

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Being thus addressed by the divine youth Mañjuśrī, Lord Śākyamuni said this to Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་གང་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: “Good, Mañjuśrī! It is good that you, acting for the benefit of many people, with compassion for the world, deem this topic to be worthy of asking the Tathāgata.

source: དེ་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Listen well and reflect upon it thoroughly.

source: ངས་བཤད་པར་བྱའོ། །ཁྱོད་ཀྱི་རས་རིས་ཀྱི་ཆོ་ག་རབ་འབྱམ་སྔགས་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ་ལ་རབ་ཏུ་འཇུག་པ་མཐར་གྱིས་ངས་བཤད་པར་བྱའོ། །
en: I will teach your painting procedure to you in full—the procedure that is the means for all sentient beings to accomplish their practice.

source: སྔོན་ཡང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བསྟན་ཏེ་ད་ལྟར་ཡང་ངས་བཤད་པར་བྱའོ། །
en: I will teach it just as it was previously taught by all the tathāgatas, introducing and expounding it in the right order. I will teach it now. {4.4}

source: དང་པོར་རེ་ཞིག་སའི་ཕྱོགས་གཙང་བ་རྡུལ་མེད་པ་ལས་རས་བལ་ཡང་དག་པར་བླངས་ལ། དམ་ཚིག་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱིས་རས་བལ་དེ་ཡང་
en: “To start, the maṇḍala master should bring cotton to a patch of ground free of impurities and have it cleaned by people who have taken up the samaya vows.

source: དག་པར་བྱས་ཏེ། ཡང་སྔགས་འདིས་དཀྱིལ་འཁོར་གྱིས་བརྒྱ་རྩ་བརྒྱད་ཏུ་བསྔགས་པར་བྱའོ། །
en: When it has been cleaned, the maṇḍala master should incant it with the mantra, as given next, one hundred and eight times. {4.5}

source: ན་མཿས་མནྟ་བུད་དྷཱ་ནཱཾ། བོ་དྷི་ས་ཏྭ་ཨ་པྲ་ཏི་ཧ་ཏ་ག་ཏི་མ་ཏི་པྲ་ཙཱ་རི་ཎཱཾ། ན་མཿསཾ་ཤོདྷ་ན་དུཿཁ་པྲ་ཤ་མ་ནེནྡྲ་རཱ་ཛཱ་ཡ། ཏ་ཐཱ་ག་ཏཱ་ཡ་ཨརྷ་ཏེ་སམྱཀྶཾ་བུད་དྷཱ་ཡ། ཏདྱ་ཐཱ། ཨོཾ་ཤོ་དྷ་ཡ་སཾ་ཤོ་དྷ་ཡ། སརྦ་བིགྷྣཾ་གྷ་ཏ་ཀ་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ་ཀུ་མཱ་ར་རཱུ་པ་དྷཱ་རི་ཎི། བི་ཀུརྦ་བི་ཀུརྦ། ས་མ་ཡམ་ནུ་སྨ་ར་ཏིཥྛ་ཏིཥྛ་ཧཱུཾ་ཧཱུཾ་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: “Homage to all the buddhas and bodhisattvas whose intentions are impeccable and who practice impeccable conduct. Homage to the sovereign king of kings who purifies and pacifies suffering, the tathāgata, the worthy one, the perfectly awakened one. The mantra is as follows: “ Oṁ , purify purify! You are the destroyer of all obstacle makers, one of great compassion, possessed of the form of divine youth! Transform, transform! Remember your samaya! Remain, remain! Huṁ huṁ, phaṭ phaṭ, svāhā! {4.6}

source: དེ་ནས་གྲོང་གི་ཆོས་མི་ཤེས་པའི་གཞོན་ནུ་མ།
en: “Then the maṇḍala master should procure a young girl, who has not yet had a sexual experience,

source: བྲམ་ཟེའི་རིགས་དང་རྒྱལ་རིགས་སུ་སྐྱེས་པ་དང་།
en: born into a brahmin, kṣatriya, or vaiśya family.

source: རྗེའུའི་རིགས་སུ་སྐྱེས་པ་དང་རིགས་ངན་པའི་སྐྱེས་གནས་ཡོངས་སུ་སྤངས་པ། །དབང་པོ་མ་ཚང་བ་མེད་པ། ཡན་ལག་ཐམས་ཅད་མཛེས་པ་ཕ་དང་མས་རྗེས་སུ་གནང་བ། གསོ་སྦྱོང་བྱས་པ།
en: Those of a low-caste origin should be avoided. She should be physically unimpaired and beautiful in every limb. She should have obtained permission to take part in the ritual from her mother and father and should be observing the ritual fast.

source: བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ། སྙིང་རྗེ་དང་ལྡན་པ།
en: She should have developed bodhicitta and be compassionate.

source: བཞིན་དཀར་བ། ཁ་དོག་གཞན་རྣམ་པར་སྤངས་པ།
en: She should have a clear, light complexion without any discoloration.

source: མདོར་ན་བུད་མེད་ཀྱི་མཚན་ཉིད་རབ་ཏུ་ཞི་བའི་མཚན་ཉིད་ཀྱིས་མཚན་པ།
en: In short, she must have all the auspicious marks of a woman.

source: ཤིན་ཏུ་ཉིན་ཞག་ཤིས་པ་དང་། ཟླ་བ་ཡར་ངོ་དང་གཟའ་བཟང་པོ་བལྟས་ཏེདུ་བ་དང་ཁུག་རྣ་མེད་ཅིང་སྤྲིན་དང་བྲལ་བ་རླུང་མེད་ཅིང་གཙང་བའི་ས་ཕྱོགས་སུ་སྔར་བསྟན་པའི་གཞོན་ནུ་མ་ཁྲུས་བྱས་ཤིང་གོས་གཙང་མ་བགོས་ཏེ། གོས་ཀྱིས་ལེགས་པར་བཀབ་པ་བྱས་པ་ལ་སྔགས་འདི་ཕྱག་རྒྱ་ཆེན་པོ་དང་ལྡན་པས་བསྲུང་བར་བྱ་སྟེ།
en: On an auspicious day of the bright fortnight, having ascertained that the planets are astrologically auspicious and bright, in a clean, windless place that is free from smoke, fog, and clouds, having bathed the previously described girl, the maṇḍala master should dress her nicely in clean clothes and perform the protection ritual employing the mantra as given next along with the great mudrā.

source: ཙནྡན་དཀར་པོ་དང་། གུར་གུམ་སྲོག་ཆགས་མེད་པའི་ཆུ་དང་སྦྱར་བས་རས་བལ་དེ་དང་བུ་མོ་དེ་སྔགས་དེ་ཉིད་ཀྱིས་ཡང་དག་པར་སྦྱངས་ཏེ་གཏོར་ལ།
en: He should mix some white sandalwood and saffron with water that is free of living organisms and, while the girl is drinking it, he should sprinkle her with this water, purified with the same mantra. {4.7}

source: ཙནྡན་དཀར་པོ་དང་། གུར་གུམ་གྱི་ཆུས་སྟེང་དང་འོག་དང་ཕྱོགས་བཞིར་ཡང་གཏོར་བར་བྱའོ། །
en: “He should throw white sandalwood and saffron-scented water in the four cardinal directions, upward, downward, and in the four intermediate directions.

source: ཙནྡན་དཀར་པོ་དང་གུར་གུམ་དང་ག་བུར་གཅིག་ཏུ་བྱས་པའི་བདུག་པས་བདུག་པར་བྱ་སྟེ། རང་ཉིད་ཀྱིས་སྦྱིན་པའམ། སྒྲུབ་པའི་གྲོགས་མཆོག་གི་སློབ་དཔོན་གྱིས་སྦྱིན་པར་བྱའོ། །
en: Having blended white sandalwood, saffron, and camphor together, the master should offer it himself or have the practitioner do this.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་ས་བཅུའི་དབང་ཕྱུག་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས། རས་ཀྱི་དོག་པ་འདི་ལ་ལྷག་པར་གནས་པར་མཛོད་ཅིག་ཅེས་ལན་གསུམ་བརྗོད་པར་བྱའོ། །
en: The following should be spoken three times: {4.8} “ ‘May the blessed buddhas and the great bodhisattvas established on the tenth bodhisattva level bless the thread for making this cloth.’ ” {4.9}

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དགོངས་སུ་གསོལ་ཞེས་བྱས་ནས།
en: “The blessed buddhas and the great bodhisattvas will subsequently give their attention to the ritual.

source: བདུག་པས་བདུག་པ་དེའི་དུས་སུ་རྨ་བྱ་དང་། ཁྲུང་ཁྲུང་དང་ངང་པ་དང་བཞད་དང་ངུར་པ་རྣམ་པ་སྣ་ཚོགས་བྱ་དགེ་བ་ཐང་ལ་གནས་པའམ། ཆུ་ལ་སྤྱོད་པ་རྣམས་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་བའམ། དགེ་བའི་སྐད་འདོན་ན་
en: While the master burns incense, at that time peacocks, curlews, wild geese, cranes, and ruddy geese—many beautiful birds who live on water or on land—will fly up into the air and utter their auspicious cries.

source: ལས་འདི་ནི་འབྲས་བུ་དང་བཅས་པ་ཡིན་ནོ་ཞེས་སྒྲུབ་པ་པོས་ཤེས་པར་བྱའོ། །
en: The practitioner should then know, ‘My rite will bear fruit.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་བདག་གི་རས་སྐུད་འདི་ལ་བྱིན་གྱིས་བརླབས་ཏེ།
en: The holy buddhas and the great bodhisattvas have blessed my canvas thread for me.

source: བདག་གི་སྐྱེ་བ་དམ་པ་ནི་ལེགས་པར་འཚོ་བ་ཡིན་ཏེ། བདག་གི་སྔགས་སྒྲུབ་པ་འབྲས་བུ་མེད་པར་མི་འགྱུར་རོ། །
en: My present life will be a happy one, and my mantra accomplishment will not be in vain.’ {4.10}

source: རྔ་པ་ཊ་ཧ་དང་རྔ་བོ་ཆེ་དང་རྫ་རྔ་དང་དུང་དང་པི་བང་དང་གླིང་བུ་དང་ཁར་རྔ་དང་རྫ་རྔ་ཆེན་པོའི་སྒྲ་ཐོས་པའམ།
en: “The sounds of drums—big, medium, and small—conchs, lutes, flutes, cymbals, and tambourines will be heard.

source: བུད་མེད་དང་ཁྱེའུའམ། བུ་མོའམ་སྐྱེས་པ་རྣམས་བཅོས་མའམ་བཅོས་མ་མ་ཡིན་པ་དེའི་དུས་སུ་བློ་བུར་དུ་འདི་སྐད་ཅེས།
en: Women, boys, girls, and men—both real and imagined —will at that time spontaneously say the following:

source: རྒྱལ་བ་དང་གྲུབ་པ་དང་སྦྱིན་པ་དང་བྱིན་པ་དང་ཁྱེར་ཅིག་ཅེས་པ་དང་།
en: “ ‘Victory is accomplished! Take the offering that has been offered!

source: དཔལ་དང་འབྲས་བུ་དང་། འབྲས་བུ་ཡོད་པ་དང་། ཆོ་ག་དང་བརྒྱ་བྱིན་དང་།
en: This is glorious and fruitful, with an opulence matching that of Śakra!’ {4.11}

source: མང་པོ་དང་དེ་དག་ལ་སོགས་པའི་སྒྲ་གཞན་རབ་ཏུ་དགེ་བ་འདོན་པའམ་དྲིལ་བུའི་སྒྲ་དང་དགའ་བའི་སྒྲ་ཐོས་ན
en: “They, and others too, will say similar words. Sounds of a bell or sounds of rejoicing may also be heard.

source: དེས་ན་རིག་པ་འཛིན་པས་ཤེས་པར་བྱ་བ་ནི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ནི་འདི་ཡིན་ཏེ།
en: Only then will the knowledge holder know that the thread has been blessed by the holy buddhas and the great bodhisattvas, not in any other way.

source: དོན་ཡོད་པའི་གྲུབ་པ་ནི་འདི་ཡིན་ཞིང་གཞན་དུ་མ་ཡིན་ནོ་ཞེས་སོ། །
en: The accomplishment will not be futile. {4.12}

source: ཅི་སྟེ་དེའི་དུས་སུ་མ་རུངས་པའི་ཚིག་འདོན་པ་ཁྱེར་ཅིག་ཟོ་ཤིག་ཟུང་ཤིག །ཉམས་པ་རྣམ་པར་ཉམས་པ། ཀྱི་ཧུད་རིང་བ་ཤིན་ཏུ་རིང་བ་མེད་པ་ཞེས་བྱ་བ་ལ་སོགས་པའི་སྒྲ་འདོན་པའམ།
en: “But, on that occasion, they may also say harsh words, such as: “ ‘Seize, devour, and cause others to devour! It is lost, lost completely. Alas! It is far, very far! It is gone!’ {4.13} “They could say words such as these.

source: སྤྲེའུ་དང་མ་ཧེ་དང་ཅེ་སྤྱང་དང་བོང་བུ་དང་བྱི་ལ་དང་། བ་ལང་དང་དུད་འགྲོ་སྨད་པ་རྐང་གཉིས་སམ་རྐང་བཞི་པའི་སྒྲ་འདོན་པར་གྱུར་ན
en: Also, the monkeys, buffaloes, jackals, donkeys, cats, and other detestable humans and animals might utter their cries.

source: དེས་ནི་སྒྲུབ་པ་པོས་བདག་གི་དངོས་གྲུབ་ནི་མེད་པ་ཡིན་ནོ་ཞེས་ཤེས་པར་བྱ་སྟེ། སྐབས་དེར་བརྟུལ་བར་བྱ་ཞིང་ཡང་སྔ་མ་བཞིན་དུ་ཡང་བརྩམ་པར་བྱའོ། །
en: The practitioner will then realize that he has not succeeded, and that his present life will be short. As an option, he can do the preliminary practice

source: དེ་བཞིན་དུ་ལན་བདུན་གྱི་བར་དུ་བྱས་ལ།
en: and repeat the procedure from the beginning up to seven times.

source: བདུན་པའི་ལས་ཀྱི་བྱ་བ་ལ་ནི་མཚམས་མེད་པ་ལྔ་བྱས་པ་ཡང་འགྲུབ་པར་འགྱུར་རོ། །
en: After the seven performances of the ritual, even someone who has committed the five acts of immediate retribution will succeed. {4.14}

source: དེ་ནས་སྒྲུབ་པ་པོས་གཞོན་ནུ་མ་དེ་བསྲུང་བ་བྱས་ལ་ཀུ་ཤའི་ཁྲེས་ལ་གཞག་པར་བྱ་སྟེ།
en: “The practitioner should then perform the protection ritual for the previously selected girl and have her sit on a bundle of kuśa grass.

source: ཤར་རམ་བྱང་ཕྱོགས་སུ་ཕྱོགས་པར་བཞག་ལ་བདག་ཉིད་སྲུང་བ་དང་ལྷ་ལ་དབུལ་བའི་ཁ་ཟས་ཟས་སུ་སྦྱིན་ནོ། །
en: He should place her facing the east or north, get his sacrificial food, and feed it to her.

source: སྔར་སྦྱང་བ་བྱས་པའི་ཀུ་ཤའི་ཁྲེས་དེ་ཉིད་ཀྱི་ཆོ་གས་རས་བལ་ལ་ཡང་བྱའོ། །
en: Following this procedure, he should have her spin the cotton upon the bundle of kuśa grass that was prepared beforehand. {4.15}

source: དོག་པ་དེ་འཇམ་པ་དང་ལེགས་པར་བསྒྲིམས་པ་དང་སྔར་བསླབས་པའི་བུ་མོས་ཡང་དག་པར་བླངས་ཏེ།
en: “The thread, well spun and white, should be twisted together by a girl who has previously been trained.

source: གཅིག་དང་གསུམ་དང་ལྔ་དང་བརྒྱད་ལ་སོགས་པ་ནས་བཅུ་དྲུག་གི་བར་རམ། ཀར་ཤའི་གྲངས་ལེགས་པར་བགྲངས་པ་དང་ལྡན་པས་བྱའོ། །
en: It should be well measured into units of one, three, five, eight, or up to sixteen palas or karṣas.

source: དེ་ལ་རབ་ནི་བཅུ་དྲུག་བྱ། །
en: The best would be of sixteen units.

source: དེ་བཞིན་བརྒྱད་ནི་བར་མ་སྟེ། །
en: The middling would be of eight units.

source: ཕྲན་ཚེགས་ལས་ལ་སྒྲུབ་པ་ནི། །གཅིག་དང་ལྔ་ནི་ཐ་མའོ། །
en: The next in rank would be of five units. In rites where the target is of minor significance, the thread should be of one unit.

source: ལས་རྣམས་ཀུན་ལ་སྔགས་རིག་པས། །ཅི་ལྟར་ནུས་པ་བཞིན་དུ་བྱ། །
en: A mantra adept should use this scheme in all rites according to his ability. {4.16}

source: དེ་ནས་བརྩམས་ཏེ་གང་ཅུང་ཟད། །སྡིག་པ་སྔར་ནི་བྱས་པ་དག །
en: “From then onward, Whatever bad karma one has previously committed Will be destroyed in an instant,

source: དོག་པར་སེམས་ཀྱིས་དམིགས་པ་ན། །དེ་ཡི་མོད་ལ་འཇིག་པར་འགྱུར། །
en: As his mind focuses on the thread. {4.17}

source: དོག་པ་འདི་དག་ཡང་དག་བླངས། །གཙང་མའི་སྣོད་དུ་གཞུག་པར་བྱ། །
en: “He should take this thread And place it in a clean container.

source: དེ་ནས་བཞག་པ་བྱས་ནས་དེ། །ག་བུར་གྱི་ནི་བདུག་པས་བདུག །
en: Having placed it there, He should cense it with an incense of camphor {4.18}

source: སྲོག་ཆགས་ཡན་ལག་བྱུང་བའམ། །གུར་གུམ་ཙནྡན་ལ་སོགས་དང་། །མེ་ཏོག་མ་ལེ་ཙམ་པ་ཀ །དྲི་ཞིམ་སོགས་པས་ཡོངས་སུ་བསྒོ། །
en: “Or other substances not derived from the bodies of living beings, Such as saffron, sandalwood, and so forth. He should worship it with fragrant flowers Such as jasmine, champak, and others. {4.19}

source: བསྲུང་བའི་ཆོ་ག་བྱས་ནས་ནི། །གཙང་མའི་ཕྱོགས་སུ་ཡང་དག་བཞག །སྔགས་རིག་ལས་ཀུན་ཤེས་པ་ཡིས། །ཤིན་དུ་མཉམ་གཞག་བཟླས་པ་བྱ། །
en: “The mantra adept, familiar with all the rites, Having recited the mantra as required, well focused, Should place the thread in a clean place For which the protection rite has been performed. {4.20}

source: དེ་ནས་ཐ་ག་པར་སོང་ནས། །ཅི་འདོད་པ་ཡི་རིན་སྦྱིན་ནོ། །
en: “He should then go to a weaver And pay him a fee of his choice.

source: རང་དབང་ཡན་ལག་མ་ཉམས་དང་། །དཀར་པོའི་ཆོས་ལ་རྟག་ཏུ་དད། །
en: The weaver should not be lacking any limbs, Not be emaciated, and always delight in the pure Dharma. {4.21}

source: རྒན་མིན་ནད་ཀྱིས་གདུངས་པ་མིན། །ལུད་པ་དབུགས་མི་བདེ་བ་སྤངས། །
en: “He should not be afflicted with illnesses, not be too old, And be free from coughing and asthma.

source: མ་ནིང་སྨད་པ་མ་ཡིན་དང་། །འཕྱེ་བོ་མ་ཡིན་སྐྲ་དཀར་སྤངས། །
en: He should not be impotent, And should be of a blameless origin. {4.22}

source: ཀུན་གྱིས་བཀུར་བའི་མཚན་ཉིད་ལྡན། །རབ་བསྔགས་བལྟ་ན་སྡུག་པ་དང་། །
en: “He should be faultless, Have no hump, and not be lame. He must have all the auspicious marks And be praiseworthy and good looking. {4.23}

source: བློ་དང་ཡང་དག་སྤྱོད་པ་དགེ། །འཇིག་རྟེན་པ་ཡི་ཚུལ་ལ་བརྟེན། །
en: “He should be pure in mind, virtuous in conduct, And depend for his livelihood on a profession approved by the world.

source: དངོས་གྲུབ་འདོད་པས་དེ་ལ་ནི། །རས་བཟང་བཏགས་པའི་ཆེད་དུ་བསྐུལ། །
en: The practitioner who seeks accomplishment in this ritual Should request him to weave the best of cloths. {4.24}

source: གྲོགས་པོ་རིགས་བཟང་རབ་བསྔགས་ཤིང་། །བློ་ལྡན་བཟོ་ནི་མཁས་པ་དང་། །
en: “His assistants should be praiseworthy, of good caste, Intelligent, and well trained

source: ཤིན་ཏུ་ཁྱད་པར་མཆོག་གྱུར་པའི། །རས་ཐག་བཟང་ལ་བསྐུལ་བར་བྱ། །
en: In weaving the best cloth Of the highest quality. {4.25}

source: རབ་ནི་རབ་ཏུ་བསྒྲུབ་པར་བྱ། །
en: “For the highest rite, the mantra adept should follow the highest routine;

source: འབྲིང་ནི་འབྲིང་ལ་བསྒྲུབ་པར་བྱ། །
en: For the medium, he should follow the medium.

source: ཐ་མལ་ཕྲན་ཚེགས་ལས་ལ་ནི། །དམན་པ་ཉིད་ནི་ཐམས་ཅད་ལ། །
en: He should follow other routines Whenever the deeds are low or insignificant, {4.26}

source: བཟོ་བོ་ཅི་ལྟར་སྨྲ་བ་བཞིན། །རིན་ནི་དེ་ལྟར་སྦྱིན་པར་བྱ། །
en: “Paying whatever price The craftsman specifies.

source: དང་པོའི་ཚིག་ནི་ཡང་དག་འབྱུང་། །བཟོ་བོ་ལ་ནི་སྔགས་རིགས་པས། །
en: At the first utterance of the craftsman The mantra adept should {4.27}

source: དེ་ནས་མྱུར་དུ་རིན་བྱིན་པ། །དཔའ་བོའི་ཚོང་ཞེས་དེ་ལ་བརྗོད། །
en: “Promptly make the payment— This is called the ‘heroes’ transaction,’

source: དོན་དུ་གཉེར་མེད་དེ་ལ་ནི། །རིན་དུ་སྨྲ་བྱེད་སྒྲུབ་པ་པོ། །
en: Since the mantra reciter pays After a mere request, without bargaining. {4.28}

source: འདི་ནི་མྱུར་དུ་འགྲུབ་བྱེད་པའི། །རས་ནི་བཟང་པོ་བླ་ན་མེད། །
en: “This supreme and best of cloths Swiftly produces accomplishment,

source: ལས་ཀུན་བྱེད་ཅིང་མཆོད་པ་སྟེ། །ལྷ་དང་མི་ཡི་བདེ་བ་སྦྱིན། །
en: Fulfills all rites, is venerable, And bestows divine and human happiness.

source: འབྱུང་པོ་ཀུན་གྱི་དཔལ་འགྱུར་ཞེས། །ཡང་དག་རྫོགས་སངས་རྒྱས་ཀྱིས་གསུངས། །
en: The perfectly awakened buddhas taught That this was auspicious for all beings. {4.29}

source: དེ་ནས་རིག་པ་འཛིན་པས་ཐ་ག་པ་ལ་རྒྱུ་སྐར་བཟང་པོའམ། ཆོ་འཕྲུལ་གྱི་ཟླ་བ་ཕྱེད་དམ་ཉིན་ཞག་དགེ་བའམ་གཟའ་དགེ་བ་བལྟས་ཏེ་གསོ་སྦྱོང་སྦྱིན།
en: “Then the knowledge holder should prescribe to the weaver the observance of a fast and, during an auspicious lunar asterism, on a bright day during the ‘fortnight of miracles’ when the planets have been ascertained as auspicious,

source: ཡང་ན་དུས་ཀྱི་མཆོག་དཔྱིད་ཀྱི་དུས་ཀྱི་ཟླ་བ་ཡར་གྱི་ངོ་ལ་ཤིང་ཨ་མྲའི་མེ་ཏོག་སྐྱེས་ཤིང་ཤིང་གི་མཆོག་རྣམས་ཀྱི་ཡལ་ག་དང་མེ་ཏོག་རྒྱས་པ་དེའི་དུས་མཚམས་སུ།
en: or during another bright fortnight, in the spring, that best of seasons when mango trees are garlanded with blossoms and the best of trees are fully in bloom,

source: སྔ་དྲོ་ཉི་མ་འཆར་བ་ལ་སྔར་བསྟན་པའི་ཐ་ག་པ་ལྷ་ལ་དབུལ་བར་འོས་པའི་ཁ་ཟས་བསྟེན་ཅིང་།
en: in the morning when the sun has risen, he should give sacrificial food to the weaver who fits the previously described characteristics.

source: གོས་གཙང་མ་བགོས་ལ་མགོ་ལ་ཅོད་པན་བཅིངས་ནས་
en: He should dress him in clean clothes, tie a turban on his head,

source: ཁྲུས་ལེགས་པར་བྱས་ཏེ
en: bathe and anoint him well,

source: ཙནྡན་དཀར་པོ་དང་གུར་གུམ་གང་ཡང་རུང་བས་ལུས་བྱུགས་ནས་ག་པུར་གྱི་དྲིས་ཁ་ལ་བསྒོས་ཏེ་ཡིད་དགའ་བ་དང་བཀྲེས་པ་དང་སྐོམ་པ་མེད་པར་བྱས་ཏེ།
en: and smear his body with white sandalwood and saffron or some other such fragrance. He should perfume the weaver’s mouth with camphor, cheer him up, and make sure that he is neither hungry nor thirsty.

source: ཐགས་ཀྱི་ལག་ཆ་ཐ་ག་པ་ལ་སོགས་པའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་སར་པ་ལ་ས་དང་བ་ལང་གི་ལྕི་བས་བཀྲུས་ཏེ།
en: The knowledge holder should then thoroughly clean the weaving implements, the rope, and other tools, using clay and cow dung.

source: ཡང་བའི་རྣམ་ལྔས་བཀྲུ་བར་བྱའོ། །
en: Placing them in front, he should rinse them with the five products of a cow again and again. {4.30}

source: དེ་ནས་སྲོག་ཆགས་མེད་པའི་ཆུས་ཀྱང་བཀྲུ་བར་བྱའོ། །
en: “Then, having rinsed them with water free of living organisms,

source: ཙནྡན་དཀར་པོ་དང་གུར་གུམ་གྱི་ཆུས་ཀྱང་གཏོར་བར་བྱའོ། །
en: he should ritually besprinkle them with white sandalwood and saffron.

source: གཙང་མའི་ས་ཕྱོགས་སུ་ཅ་ཅོ་མེད་ཅིང་སྐྱེ་བོ་དང་བྲལ་བ་དབེན་པའི་གནས་སུ་བཀབ་པ་དང་གསང་བར་མེ་ཏོག་གིས་མཆོད་དོ། །
en: Having chosen a clean spot on the ground in a place free from noise and people, the practitioner should sit on a seat that is secluded, peaceful, and adorned with flowers.

source: དེ་ནས་སྒྲུབ་པ་པོས་ཡང་དག་པར་དག་པར་བྱེད་པའི་སྔགས་ཀྱིས་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་པའི་ཡུངས་ཀར་གྱིས་ཕྱོགས་བཞི་སྟེང་འོག་ཕྱོགས་མཚམས་སུ་གཏོར་བར་བྱའོ། །
en: He should then throw white mustard seeds incanted one hundred and eight times with the purification mantra in the four cardinal directions, upward, downward, and in the four intermediate directions.

source: དེ་ནས་ཐ་ག་པ་ལ་ཡུངས་ཀར་གྱིས་གཏོར་བར་བྱ་ཞིང་། ཕྱག་རྒྱ་ཆེན་པོ་གཙུག་ཕུད་ལྔ་བཅིངས་ཏེ།
en: Then, having cast mustard seeds at the weaver, he should form the great five-crested mudrā

source: གཙུག་ཕུད་བཅིང་བ་བྱས་ན་སྲུང་བ་ཆེན་པོ་བྱས་པར་འགྱུར་རོ། །
en: and tie his hair into a topknot. This will afford powerful protection. {4.31}

source: གལ་ཏེ་རས་རིས་རབ་ཡིན་ན་ནི། ཟུར་བཞིར་ཞེང་དུ་ཁྲུ་བཞི་ཆུར་ཁྲུ་བརྒྱད་དེ།
en: “If the cloth is going to be of the superior kind, it should be four cubits wide and eight cubits long;

source: ཐ་ག་པས་དེ་ཙམ་ལ་ཡོངས་སུ་གོམས་པར་བྱའོ། །
en: he should supply the weaver with enough material for these measurements.

source: འབྲིང་ནི་ཞེང་དུ་ཁྲུ་དོ་ཆུར་ཁྲུ་ལྔ་པའོ། །
en: If the cloth is going to be of the medium kind, it should be two cubits wide and five cubits long.

source: ཐ་མ་ནི་ཞེང་དུ་བདེ་བར་གཤེགས་པའི་མཐོ་གང་ཆུར་ནི་ཁྲུ་བརྒྱད་ཀྱི་ཕྱེད་དོ། །
en: If it is to be of the smallest kind, it should have the width equal to the thumb-to-index-finger measurement of the Sugata, and the length of one cubit.

source: དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་མཐོ་གང་ལ་ནི་ཡུལ་དབུས་ཀྱི་སྐྱེས་བུ་ཚད་དང་ལྡན་པའི་ཁྲུ་གཅིག་སྟེ།
en: Regarding these particular measurements, the thumb-to-index-finger measurement of Lord Buddha corresponds to the length of the forearm of a man from the central region —

source: འདི་ལ་བདེ་བར་གཤེགས་པའི་མཐོ་ཞེས་བསྒྲགས་ཏེ། ཚད་འདིས་ཚད་དུ་བསྟན་པ་ཡིན་ནོ། །
en: this is what is known as the Buddha’s thumb-to-index-finger measurement as a unit of length.

source: རས་ནི་རབ་ཀྱིས་དངོས་གྲུབ་མཆོག །འཇིག་རྟེན་གང་ཟག་མཆོག་གིས་གསུངས། །
en: The cloth is said to be of the authentic size when these measurements are used. {4.32} “When the cloth is of the superior kind, The superior accomplishment will arise, as taught by the most eminent of men.

source: ཐུབ་པ་མྱ་ངན་འདས་འོག་ཏུ། །རྒྱལ་སྲིད་འདོད་ལ་བར་མ་ཡིན། །
en: The medium cloth is for those desiring royal status After the sage has disappeared. {4.33}

source: ལོངས་སྤྱོད་ཆེ་འདོད་སྐྱེས་བུ་དང་། །ལྷ་མི་ལྷ་མིན་གདེངས་ཅན་ནི། །ཐ་མ་ལ་ནི་གྲུབ་པར་བཤད། །
en: “When the cloth is of the lowest quality, the accomplishment is said To belong to the seekers of great prosperity Who will attain the comforts of the three classes of gods and the asuras.

source: འབྲིང་གིས་འབྲིང་ནི་གྲུབ་པའོ། །
en: When middling, the accomplishment will be middling. {4.34}
